app/Helpers/base_helper.php

SELECT round(AVG(`rating`)) as rateavg
FROM `review`
WHERE `product_id` = '21'
AND `is_delete` = 0
---
function get_review_count($id)
{
    $db = \Config\Database::connect();
    $builder = $db->table('review');
    $builder->select('round(AVG(`rating`)) as rateavg');
    $builder->where('product_id', $id);
    $builder->where('is_delete', 0);
    $query = $builder->get();

SELECT SUM(`rating`) as ratesum
FROM `review`
WHERE `product_id` = '21'
AND `is_delete` = 0
---
function get_review_total($id)
{
    $db = \Config\Database::connect();
    $builder = $db->table('review');
    $builder->select('SUM(`rating`) as ratesum');

    $builder->where('product_id', $id);
    $builder->where('is_delete', 0);
    $query = $builder->get();