app/Models/admin/HomeModel.php

    public function insert_edit_slider($post, $file)
    {
        //   print_r($post);exit;

        $db = $this->db;
        $builder = $db->table('slider');
        $builder->select('*');
        $builder->where(array('id' => $post['id']));
        $query = $builder->get();
---
SELECT *
FROM `slider`
WHERE `id` = '6'

    public function get_order_details($id)
    {
        // print_r($id);exit;
        $db = $this->db;
        $builder = $db->table('orders o');
        $builder->select('o.*,o.created_at as order_date,oi.*,i.*');
        $builder->join('order_item oi', 'o.id = oi.order_id', 'left');
        $builder->join('item i', 'i.id = oi.product_id');
        $builder->where('o.id', $id);
        $query = $builder->get();
        $order_detail1 = $query->getRowArray();

        if ($order_detail1['default_add'] != 0) {
            $db = $this->db;
            $builder = $db->table('user u');
            $builder->select('u.*,s.sname as state_name,c.cname as city_name');
            $builder->join('cities c', 'c.id=u.city');
            $builder->join('states s', 's.id=u.state');
            $builder->where('u.id', $order_detail1['default_add']);
            $builder->where('u.is_delete', 0);
            $query = $builder->get();
            $order_detail2 = $query->getRowArray();
        } else {
            $db = $this->db;
            $builder = $db->table('shipping_address a');
            $builder->select('a.*,s.sname as state_name,c.cname as city_name');
            $builder->join('cities c', 'c.id=a.city');
            $builder->join('states s', 's.id=a.state');
            $builder->where('a.id', $order_detail1['ship_id']);
            $builder->where('a.is_delete', 0);
            $query = $builder->get();
---
SELECT `o`.*, `o`.`created_at` as `order_date`, `oi`.*, `i`.*
FROM `orders` `o`
LEFT JOIN `order_item` `oi` ON `o`.`id` = `oi`.`order_id`
JOIN `item` `i` ON `i`.`id` = `oi`.`product_id`
WHERE `o`.`id` = '2'
SELECT `a`.*, `s`.`sname` as `state_name`, `c`.`cname` as `city_name`
FROM `shipping_address` `a`
JOIN `cities` `c` ON `c`.`id`=`a`.`city`
JOIN `states` `s` ON `s`.`id`=`a`.`state`
WHERE `a`.`id` = '5'
AND `a`.`is_delete` = 0