app/Models/HomeModel.php

SELECT *
FROM `brand`
WHERE `is_delete` = '0'
ORDER BY RAND()
 LIMIT 8
---
    public function get_randomcategory_data($post, $id)
    {
        //  print_r($post);exit;
        $db = $this->db;
        $builder = $db->table('item');
        $builder->select('*');
        if ($id != '') {
            $builder->where('brand', $id);
        }
        if (isset($post['sort'])) {

            if ($post['sort'] == 'lowtohigh') {
                $builder->orderBy('price', 'asc');
            } elseif ($post['sort'] == 'hightolow') {
                // echo '<pre>'; print_r($post);exit;
                $builder->orderBy('price', 'desc');
            } else {
                $builder->orderBy('id', 'RANDOM');
            }
        }
        $builder->where('is_delete', '0');
        $builder->limit(8);
        $query = $builder->get();