app/Models/HomeModel.php

SELECT *
FROM `brand`
WHERE `is_delete` = '0'
ORDER BY RAND()
 LIMIT 8
SELECT `i`.*, `b`.`brand` as `brand_name`, `c`.`category` as `category_name`
FROM `item` `i`
JOIN `brand` `b` ON `b`.`id`=`i`.`brand`
JOIN `category` `c` ON `c`.`id`=`i`.`category`
WHERE `i`.`is_delete` = '0'
ORDER BY RAND()
 LIMIT 8
---
    public function get_randomitem_data()
    {
        $db = $this->db;
        $builder = $db->table('item i');
        $builder->select('i.*,b.brand as brand_name,c.category as category_name');
        $builder->join('brand b', 'b.id=i.brand');
        $builder->join('category c', 'c.id=i.category');
        $builder->orderBy('i.id', 'RANDOM');
        $builder->where('i.is_delete', '0');
        $builder->limit(8);
        $query = $builder->get();

SELECT *
FROM `category`
WHERE `is_delete` = '0'
ORDER BY `id` DESC
---
    public function get_product_data($id)
    {
        $db = $this->db;
        $builder = $db->table('item i');
        $builder->select('i.*,b.brand as brand_name,c.category as category_name');
        $builder->join('brand b', 'b.id=i.brand');
        $builder->join('category c', 'c.id=i.category');
        $builder->where('i.id', $id);
        $builder->where('i.is_delete', 0);
        $query = $builder->get();

SELECT *
FROM `brand`
WHERE `is_delete` = '0'
ORDER BY RAND()
---
    public function get_randombrand_data()
    {
        $db = $this->db;
        $builder = $db->table('brand');
        $builder->select('*');
        $builder->orderBy('id', 'RANDOM');
        $builder->where('is_delete', '0');
        // $builder->limit(8);
        $query = $builder->get();

SELECT *
FROM `category`
WHERE `is_delete` = '0'
ORDER BY `id` DESC
---
    public function get_randomcategory_data()
    {
        $db = $this->db;
        $builder = $db->table('category');
        $builder->select('*');
        $builder->orderBy('id', 'desc');
        $builder->where('is_delete', '0');
        // $builder->limit(8);
        $query = $builder->get();

SELECT *
FROM `review`
WHERE `is_delete` = 0
ORDER BY RAND()
---
    public function get_randomreview_data()
    {
        // print_r($id);exit;
        $db = $this->db;
        $builder = $db->table('review');
        $builder->select('*');
        $builder->orderBy('id', 'RANDOM');
        $builder->where('is_delete', 0);
        $query = $builder->get();

SELECT `o`.*, `o`.`created_at` as `order_date`
FROM `orders` `o`
WHERE `o`.`user_id` = '1'
---
    public function get_order_data()
    {
        $db = $this->db;
        $builder = $db->table('orders o');
        $builder->select('o.*,o.created_at as order_date');
        // $builder->join('order_item oi', 'o.id = oi.order_id', 'left');
        // $builder->join('item i', 'i.id = oi.product_id', 'left');
        // $builder->join('category c','c.id=i.category');
        $builder->where('o.user_id', session('uid') ? session('uid') : session('guestid'));
        $query = $builder->get();

SELECT `o`.*, `o`.`created_at` as `order_date`
FROM `orders` `o`
WHERE `o`.`id` = '2'
---
    public function get_track_order_data($id)
    {
        //   echo "<pre>"; print_r($id);exit;

        $db = $this->db;
        $builder = $db->table('orders o');
        $builder->select('o.*,o.created_at as order_date');
        $builder->where('o.id', $id);
        $query = $builder->get();

SELECT *, "default" as `type`
FROM `user`
WHERE `id` = '4'
AND `is_delete` = 0
 LIMIT 1
SELECT `a`.*, `c`.`cname`, `s`.`sname`, "shipping" as `type`
FROM `shipping_address` `a`
LEFT JOIN `cities` `c` ON `c`.`id`=`a`.`city`
LEFT JOIN `states` `s` ON `s`.`id`=`a`.`state`
WHERE `user_id` = '4'
AND `a`.`is_delete` = 0
---
    public function get_master_data($method,$id)
    {
        $db = $this->db;
        $data = array();
       if($method == 'address')
        {
            $builder = $db->table('user ');
            $builder->select('*,"default" as type');
            $builder->where('id',session('uid'));
            $builder->where('is_delete', 0);
            $builder->limit(1);
            $query = $builder->get();
            $result = $query->getResultArray();

            $builder = $db->table('shipping_address a');
            $builder->select('a.*,c.cname,s.sname,"shipping" as type');
            $builder->join('cities c','c.id=a.city','left');
            $builder->join('states s','s.id=a.state','left');
            $builder->where('user_id',session('uid') ? session('uid') : session('guestid'));
            $builder->where('a.is_delete', 0);
            $query = $builder->get();

SELECT `id`, `cname`
FROM `cities`
WHERE `state_id` = '12'
AND  `cname` LIKE '%sur%' ESCAPE '!'
---
    public function get_city($post)
    {
        // print_r($post);exit;
        $db = $this->db;
        $builder = $db->table('cities');
        $builder->select('id,cname');
        $builder->where(array('state_id' => $post['state_id']));
        $builder->like('cname', (@$post['searchTerm']) ? @$post['searchTerm'] : '');
        $query = $builder->get();