app/Models/HomeModel.php

    public function get_randomitem_data()
    {
        $db = $this->db;
        $builder = $db->table('item i');
        $builder->select('i.*');
        $builder->orderBy('i.id', 'RANDOM');
        $builder->where('i.is_delete', '0');
        $builder->limit(8);
        $query = $builder->get();
---
SELECT `i`.*
FROM `item` `i`
WHERE `i`.`is_delete` = '0'
ORDER BY RAND()
 LIMIT 8

    public function get_product_data($id)
    {
        $db = $this->db;
        $builder = $db->table('item i');
        $builder->select('i.*,b.brand as brand_name,c.category as category_name');
        $builder->join('brand b', 'b.id=i.brand');
        $builder->join('category c', 'c.id=i.category');
        $builder->where('i.id', $id);
        $builder->where('i.is_delete', 0);
        $query = $builder->get();
---
SELECT `i`.*, `b`.`brand` as `brand_name`, `c`.`category` as `category_name`
FROM `item` `i`
JOIN `brand` `b` ON `b`.`id`=`i`.`brand`
JOIN `category` `c` ON `c`.`id`=`i`.`category`
WHERE `i`.`id` = '2'
AND `i`.`is_delete` = 0

    public function get_randomslider_data()
    {
        $db = $this->db;
        $builder = $db->table('slider');
        $builder->select('*');
        $builder->orderBy('id', 'RANDOM');
        $builder->where('is_delete', '0');
        $builder->limit(8);
        $query = $builder->get();
---
SELECT *
FROM `slider`
WHERE `is_delete` = '0'
ORDER BY RAND()
 LIMIT 8

    public function get_review($id)
    {
        // print_r($id);exit;
        $db = $this->db;
        $builder = $db->table('review');
        $builder->select('*');
        $builder->where('product_id', $id);
        $builder->where('is_delete', 0);
        $query = $builder->get();
---
SELECT *
FROM `review`
WHERE `product_id` = '2'
AND `is_delete` = 0